op = int(input( "Оперативная память вашего компьютера GB: "))
ssd = int(input( "Введите размер жеского диска SSD: " ))
hdd = int(input( "Введите размер жеского диска HDD в GB: " ))
p = int(input( "Введите стоимость ноутбука: " ))
s = input( "Введите состояние ноутбука: " )
if 4<= op <= 8 and ssd >= 256 and p <= 1000 and s == 'new':
    print( "Ваш ноутбук подходит" )
elif 4<= op <= 8 and hdd >= 1000 and p <= 1000 and s == 'new':
    print( "Ваш ноутбук подходит" )
else:
    print( "Ваш ноутбук не подходит" )
